MilanFranc/ESP32-audioI2S/src/Audio.cpp
            if(!f_begin){
                if(strlen(pl) == 0) return;                             // empty line
                if(strcmp(pl, "#EXTM3U") == 0){                         // what we expected
                    f_begin      = true;
                    f_StreamInf  = false;
                    f_ExtInf     = false;
                    plsEntry     = 0;
                    return;
                }
                else{
                    m_datamode = AUDIO_HEADER;                          // m3u8 is not valid
                    m_playlistFormat = FORMAT_NONE;
                    if(audio_info) audio_info("m3u8 is not valid, switch to AUDIO_HEADER");
                    return;
                }
            }

            // example: redirection
            // #EXTM3U
            // #EXT-X-STREAM-INF:BANDWIDTH=22050,CODECS="mp4a.40.2"
            // http://ample.revma.ihrhls.com/zc7729/63_sdtszizjcjbz02/playlist.m3u8

            // example: audio chunks
            // #EXTM3U
            // #EXT-X-TARGETDURATION:10
            // #EXT-X-MEDIA-SEQUENCE:163374040
            // #EXT-X-DISCONTINUITY
            // #EXTINF:10,title="text=\"Spot Block End\" amgTrackId=\"9876543\"",artist=" ",url="length=\"00:00:00\""
            // http://n3fa-e2.revma.ihrhls.com/zc7729/63_sdtszizjcjbz02/main/163374038.aac
            // #EXTINF:10,title="text=\"Spot Block End\" amgTrackId=\"9876543\"",artist=" ",url="length=\"00:00:00\""
            // http://n3fa-e2.revma.ihrhls.com/zc7729/63_sdtszizjcjbz02/main/163374039.aac

            if(utils::startsWith(pl,"#EXT-X-STREAM-INF:")){
                int pos = utils::indexOf(pl, "CODECS=\"mp4a", 18);
                if(pos < 0){ // not found
                    m_m3u8codec  = CODEC_NONE;
                    log_e("codec %s in m3u8 playlist not supportet", pl);
                    stopSong();
                    return;
                }
                f_StreamInf = true;
                m_m3u8codec = CODEC_M4A;
                return;
            }

            if(f_StreamInf){                                                // it's a redirection, a new m3u8 playlist
                if(utils::startsWith(pl, "http")) {
                    strcpy(m_lastHost, pl);
                }
                else{
                    pos = utils::lastIndexOf(m_lastHost, "/");
                    strcpy(m_lastHost + pos + 1, pl);
                }
                f_StreamInf = false;
                connecttohost(m_lastHost);
                return;
            }

            if(m_m3u8codec == CODEC_NONE){                                                  // second guard
                if(!f_end) return;
                else {connecttohost(m_lastHost); return;}
            }

            static uint32_t seqNr = 0;
            if(utils::startsWith(pl, "#EXT-X-MEDIA-SEQUENCE:")){
                // do nothing, because MEDIA-SECUENCE is not set sometimes
            }

            static uint16_t targetDuration = 0;
            if(utils::startsWith(pl, "#EXT-X-TARGETDURATION:")) {targetDuration = atoi(pl + 22);}

            if(utils::startsWith(pl,"#EXTINF")) {
                f_ExtInf = true;
                if(STfromEXTINF(pl)) showstreamtitle(pl);
                return;
            }

            if(f_ExtInf){
                f_ExtInf = false;
//                log_i("ExtInf=%s", pl);
                int16_t lastSlash = utils::lastIndexOf(m_lastHost, "/");

                if(!m_playlistBuff){ // will  be freed in setDefaults()
                    m_playlistBuff = (char*)malloc(2 * m_plsBuffEntryLen);
                    strcpy(m_playlistBuff, m_lastHost); // save the m3u8 url at pos 0
                }

                if(plsEntry == 0){
                    seqNrPos = 0;
                    char* entryPos = m_playlistBuff + m_plsBuffEntryLen;
                    if(utils::startsWith(pl, "http")){
                        strcpy(entryPos , pl);
                    }
                    else{
                        strcpy(entryPos , m_lastHost); // if not start with http complete with host from m_lasthost
                        strcpy(entryPos + lastSlash + 1 , pl);
                    }
                    // now the url is completed, we have a look at the sequenceNumber
                    if(m_m3u8codec == CODEC_M4A){
                        int p1 = utils::lastIndexOf(entryPos, "/");
                        int p2 = utils::indexOf(entryPos, ".aac", 0);
                        if(p1<0 || p2<0){
                            log_e("sequenceNumber not found");
                            stopSong();
                            return;
                        }
                        // seqNr must be between p1 and p2
                        for(int i = p1; i < p2; i++){
                            if(entryPos[i] >= 48 && entryPos[i] <=57){ // numbers only
                                if(!seqNrPos) seqNrPos = i;
                            }
                            else{
                                seqNrPos = 0; // in case ...52397ae8f_1.aac?sid=5193 seqNr=1
                            }
                        }
                        seqNr = atoi(&entryPos[seqNrPos]);
                        //log_i("entryPos=%s", entryPos);
                        //log_i("p1=%i, p2=%i, seqNrPos =%i, seqNr=%d", p1, p2, seqNrPos, seqNr);
                    }
                }
                plsEntry++;
                return;
            }

            if(f_end){
                if(plsEntry > 0){ // we have found some (url) entries
                    processM3U8entries(plsEntry, seqNr, seqNrPos, targetDuration);
                }
                else{
                    connecttohost(m_lastHost);
                }
            }
        } //end m3u8
        // - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
        return;
    } // end AUDIO_PLAYLISTDATA
}
//---------------------------------------------------------------------------------------------------------------------
void Audio::processM3U8entries(uint8_t _nrOfEntries, uint32_t _seqNr, uint8_t _seqNrpos, uint16_t _targetDuration){

    // call up the entries in m3u8 sequentially, after the last we need a new playlist
    static uint8_t  nrOfEntries = 0;
    static uint32_t currentSeqNr = 0;
    static uint32_t sequenceNr = 0;
    static uint32_t maxSeqNr = 0;
    static uint8_t  sequenceNrPos = 0;
    static uint16_t targetDuration = 0;

    char  resp[256 + 100];
    char* host = NULL;      // e.g  http://n31a-e2.revma.ihrhls.com
    char* extension = NULL; // e.g  hls.m3u8?rj-ttl=5&rj-tok=AAABe9D0_W0AmLAedXo_MfNpLw
    char* entryaddr = NULL;

     if(!m_f_m3u8data){
        m_f_m3u8data = true;
        nrOfEntries = _nrOfEntries;
        currentSeqNr = _seqNr;
        sequenceNr = _seqNr;
        maxSeqNr = currentSeqNr + _nrOfEntries;
        sequenceNrPos = _seqNrpos;
        targetDuration = _targetDuration;
        connecttohost(m_playlistBuff + m_plsBuffEntryLen); // connect the streamserver first
        m_f_m3u8data = true; // connecttohost() will clear m_f_m3u8data, set it again

//        log_i("nrOfEntries=%d, currentSeqNr=%d, sequenceNrPos=%d targetDuration=%d", nrOfEntries, currentSeqNr, sequenceNrPos, targetDuration);
//        log_i("m3u8_url=%s", m_playlistBuff);
//        log_i("aac_url=%s", m_playlistBuff+ m_plsBuffEntryLen);

        (void)nrOfEntries;    // suppress warning -Wunused-but-set-variable
        (void)sequenceNr;
        (void)targetDuration;
        (void)resp;
        (void)host;
        (void)extension;

        currentSeqNr++;
        return;
    }

    if(_nrOfEntries == 0){ // processM3U8entries(0,0,0,0)
        if(currentSeqNr < maxSeqNr){ // next entry in playlist
            char sBuff[12];  itoa(currentSeqNr, sBuff,  10);
            entryaddr = m_playlistBuff + m_plsBuffEntryLen;
            memcpy(entryaddr + sequenceNrPos, sBuff, strlen(sBuff));
            // log_i("entryaddr=%s", entryaddr);
            goto label1;
        }
        if(currentSeqNr == maxSeqNr){ // we need a new playlist
            entryaddr = m_playlistBuff;
            // log_i("entryaddr=%s", entryaddr);


            goto label1;
        }
        if(currentSeqNr > maxSeqNr){
            return; // guard: in that case never goto label1:
        }
    }

